# SQL - Python Connection 
- First create profile in mysql
- connect through Python to mySQL to fetch values

## MySQL
- Login to mysql
    - cmd
    - mysql -u root -p (piit2025)
- create database piit
    - create database piit;
- create user piuser
  - create user 'piuser'@'%' identified by 'Pass@123' ;
  - grant all privileges on piit.* to 'piuser'@'%' with grant option ;
  - flush privileges ;
- login as piuser to mysql
    - cmd
    - mysql -u piuser -p (Pass@123)
- use databases piit
    - use piit ;
    - show tables;  (it will be nil  initially)
- create a table employees
    - CREATE TABLE employees (  employee_id INT PRIMARY KEY,   first_name VARCHAR(50),  last_name VARCHAR(50),  department VARCHAR(50),  salary DECIMAL(10, 2))
- add data into this stable
    -  INSERT INTO employees (employee_id, first_name, last_name, department, salary) VALUES   (1, 'John', 'Doe', 'HR', 50000.00),  (2, 'Jane', 'Smith', 'IT', 60000.00),   (3, 'Alice', 'Johnson', 'Finance', 55000.00),  (4, 'Bob', 'Williams', 'IT', 62000.00),   (5, 'Emily', 'Brown', 'HR', 48000.00); 
- check if tables is showing data
    - SELECT * FROM employees;

In [17]:
#pip install sqlalchemy
#pip install pymysql

In [7]:
# libraries (install if required)
from sqlalchemy import create_engine, text
import pandas as pd
import os

In [8]:
#engine1 = create_engine("mysql+pymysql://piuser:Pass@123@localhost:3306/piit")
#engine1

Engine(mysql+pymysql://piuser:***@123@localhost:3306/piit)

In [12]:
# URL-encode special chars in password if any (e.g., # -> %23, @ -> %40)  #Pass@123 - Pass%40123
engine1 = create_engine("mysql+pymysql://piuser:Pass%40123@localhost:3306/piit")
print(engine1)
#setting up connection mysql with user name - piuser, pwd - Pass@123 and to database piit at port no  3306

Engine(mysql+pymysql://piuser:***@localhost:3306/piit)

In [13]:
# function to run the query with parameters or query
def q(sql, **params):
    with engine1.connect() as conn:
        return pd.read_sql(text(sql), conn, params=params)

In [15]:
q("SELECT * FROM employees")

   employee_id first_name last_name department   salary
0            1       John       Doe         HR  50000.0
1            2       Jane     Smith         IT  60000.0
2            3      Alice   Johnson    Finance  55000.0
3            4        Bob  Williams         IT  62000.0
4            5      Emily     Brown         HR  48000.0
5          101       John       Doe         HR  50000.0
6          102       Jane     Smith         IT  60000.0
7          103      Alice   Johnson    Finance  55000.0
8          104        Bob  Williams         IT  62000.0
9          105      Emily     Brown         HR  48000.0

# this should run successfully
- Now run different queries on the tables

In [16]:
q('select * from employees where salary > 56700')

   employee_id first_name last_name department   salary
0            2       Jane     Smith         IT  60000.0
1            4        Bob  Williams         IT  62000.0
2          102       Jane     Smith         IT  60000.0
3          104        Bob  Williams         IT  62000.0